Repository: JumBoJay06/tawd_ivm
Catalog: lib/l10n/intl_*.arb
Languages: da, de, sv, zh_hant

# key
source: English
da: Dansk
de: German
sv: Svenska
zh_hant: 繁體中文

source: Language
da: Sprog
de: Sprache
sv: Språk
zh_hant: 語言

# language_choose_language
source: Select language
da: Vælg sprog
de: Sprache auswählen
sv: Välj språk
zh_hant: 選擇語言

# language_finish_setting
source: Setup complete
da: Installation udført
de: Einrichtung abgeschlossen
sv: Installation klar
zh_hant: 完成設定

source: IVM Service
zh_hant: IVM服務

# ivm_service_device_connect
source: Connect device
da: Tilslut enhed
de: Gerät anschliessen
sv: Anslut enhet
zh_hant: 連線裝置

# ivm_service_paired_device
source: Paired devices
da: Parret enheder
de: Gekoppelte Geräte
sv: Kopplad enhet
zh_hant: 曾配對裝置

# ivm_service_ble_off
source: Bluetooth Off
da: Bluetooth fra
de: Bluetooth aus
sv: Bluetooth av
zh_hant: 藍牙離線

# ivm_service_please_enable_ble
source: Please turn on Bluetooth.
da: Venligst slå bluetooth til
de: Bitte schalten Sie Bluetooth ein
sv: Vänligen stäng av Bluetooth
zh_hant: 請開啟藍牙

# common_settings
source: Settings
da: Indstillinger
de: Einstellungen
sv: Inställningar
zh_hant: 設定

# common_cancel
source: Cancel
da: Afbryd
de: Abbrechen
sv: Avbryt
zh_hant: 取消

# available_device
source: Available Devices
da: Tilgængelige enheder
de: Verfügbare Geräte
sv: Tillgängliga enheter
zh_hant: 可用裝置

# available_device_searching
source: Searching
da: Søger
de: Suchend
sv: Söker
zh_hant: 搜尋裝置中

# available_device_no_found
source: No available devices
da: Ingen tilgængelige enheder
de: Keine verfügbare Geräte
sv: Inga tillgängliga enheter
zh_hant: 無可用裝置

# available_device_research
source: Search again
da: Søg igen
de: Erneut suchen
sv: Sök igen
zh_hant: 重新搜尋

# available_device_search
source: Search
da: Søg
de: Suchen
sv: Sök
zh_hant: 搜尋

# available_device_type_device_number_quickly_find_content
source: Enter device number for quick search
da: Indsæt enhedsnummer for hurtig søgning
de: Geben Sie die Gerätenummer für die Schnellsuche ein
sv: Ange enhets nr för snabbsök
zh_hant: 輸入裝置編號以快速尋找

# available_device_paired
source: Pairing Successful
da: Tilslutning vellykket
de: Paarung erfolgreich
sv: Sammankoppling lyckad
zh_hant: 裝置配對成功

# available_device_failed
source: Pairing Failed
da: Tilslutning mislykkedes
de: Die Kopplung ist fehlgeschlagen
sv: Sammankoppling misslyckad
zh_hant: 裝置配對失敗

# common_action_menu
source: Action menu
da: Menu
de: Menu
sv: Many
zh_hant: 進入功能選單

# available_device_set_ball_id
source: Set Ball Valve ID
da: Indstil ventil ID
de: Stellen Sie die ID des Kugelhahns ein
zh_hant: 設定球閥ID

# available_device_please_retry
source: Please re-pair the device.
da: Venligst reparer enheden
de: Bitte koppeln Sie das Gerät erneut
sv: Vänligen reparera enheten
zh_hant: 請重新配對裝置

# common_ok
source: OK
zh_hant: 確定

# common_close
source: Close
da: Luk
de: Schliessen
sv: Stäng
zh_hant: 關閉

# available_device_no_paired_device_content
source: No Paired Devices
da: Ingen parret enheder
de: Keine gekoppelten Geräte
sv: Inga kopplade enheter
zh_hant: 沒有曾配對裝置

# available_device_please_connect_first_content
source: Please connect a device first.
da: Venligst tilslut en enhed
de: Bitte schließen Sie zuerst ein Gerät an.
sv: Vänligen koppla en enhet
zh_hant: 請先配對裝置

# available_device_show_devices_paired_content
source: This list only shows previously paired devices.
da: Listen viser kun tidligere parret enheder
de: In dieser Liste werden nur zuvor gekoppelte Geräte angezeigt
zh_hant: 此列表僅顯示曾配對裝置

source: Ball Valve Setting
da: Ventil indstilling
de: Einstellung des Kugelhahns
zh_hant: 球閥設定

# ball_valve_setting_set_id_content
source: To set the Ball Valve ID to record data correctly.
da: Indstil ventil ID for at registrere data korrekt.
de: So stellen Sie die Kugelhahn-ID ein, um Daten korrekt aufzuzeichnen.
zh_hant: 設定球閥ID以正確記錄資料

# ball_valve_setting_id_cannot_edited
source: The ID cannot be edited after setting.
da: ID kan ikke ændres efter indstilling.
de: Die ID kann nach der Einstellung nicht mehr bearbeitet werden.
zh_hant: ID 設定後即無法修改

source: Notice
da: Bemærk
de: Beachten
zh_hant: 注意

# ball_valve_setting_save_skip_content
source: Settings are not saved. Are you sure to skip?
da: Indstillinger er ikke gemt. Er du sikker på du vil fortsætte?
de: Einstellungen wurden nicht gespeichert. Sind Sie sicher, dass Sie fortfahren möchten?
zh_hant: 設定未儲存。確定要略過嗎？

# ball_valve_setting_yes_and_skip
source: Yes, skip to menu
zh_hant: 是的，略過跳至選單

# ball_valve_setting_comfirm
source: Setting Confirm
da: Indstilling bekræftet
de: Einstellung bestätigen
zh_hant: 設定確認

# ball_valve_setting_is_id_correct
source: Is the Ball Valve ID correct?
da: Er ventil ID korrekt?
de: Ist die ID des Kugelhahns korrekt?
zh_hant: 球閥ID正確嗎？

# ball_valve_setting_confirm_setting
source: Yes, confirm setting
da: Ja, bekræft indstilling
de: Ja, Einstellung bestätigen
zh_hant: 正確，確認設定

# ball_valve_setting_reenter
source: Re-enter
da: Genindtast
de: Erneut eingeben
zh_hant: 重新輸入

# about_device
source: Device Information
zh_hant: 裝置資訊

# ball_valve_setting_temp_abnormal
source: Temp. Abnormal
da: Temperatur unormal
de: Temperatur abnormal
zh_hant: 溫度異常

# ball_valve_setting_temp_higher
source: The device's temperature is abnormally high. Please contact the manufacturer.
da: Enhedens temperatur er unormal høj. Kontakt venligst producenten.
de: Die Temperatur des Geräts ist ungewöhnlich hoch. Bitte wenden Sie sich an den Hersteller.
zh_hant: 機器的溫度異常高。請聯繫原廠

# ball_valve_setting_maintenance_threshold
source: The Ball Valve usage reached maintenance threshold. Please perform required maintenance, then reset cycle count when complete.
zh_hant: 球閥使用次數已達到設定的週期次數。 請進行需要的維護，並在完成後重置計時設定。

# about_device_product_info
source: Product info.
da: Produkt info
de: Produktinformation
sv: Produkt information
zh_hant: 產品資訊

# about_device_date_manufacture
source: Manufacturing date
da: Fremstillingsdato
de: Herstellungsdatum
sv: Tillverknings datum
zh_hant: 出廠日期

# about_device_ball_id
source: Ball Valve ID
da: Ventil ID
de: Kugelhahn-ID
sv: Ventil ID
zh_hant: 球閥ID

# about_device_matching_date
source: Pairing date
da: Tilslutningsdato
de: Kopplungsdatum
sv: Uppkopplingsdatum
zh_hant: 配對日期

# about_device_info
source: Valve info.
da: Ventil info
de: Ventilinfo
sv: Ventil info
zh_hant: 閥門資訊

# about_device_angle
source: Angle
da: Vinkel
de: Winkel
sv: Vinkel
zh_hant: 角度

# about_device_torque
source: Torque
da: Moment
de: Drehmoment
sv: Vridmoment
zh_hant: 扭力

# about_device_emission_detection
source: Emission Detection
da: Emissionsgrad
de: Emissionserkennung
sv: Konstaterat utsläpp
zh_hant: 壓力

# about_device_cycle_counter
source: Cycle counter
da: Cyklusberegner
de: Zykluszähler
sv: Cykel räkneverk
zh_hant: 累積運作次數

# about_device_total_use
source: IVM total use
da: IVM total brug
de: IVM-Gesamtnutzung
zh_hant: 總使用次數

# common_times
source: time(s)
da: Tid (s)
de: Zeit (s)
sv: Tid (s)
zh_hant: 次

# about_device_refreshed
source: Refreshed
da: Opdateret
de: Aktualisiert
sv: Uppdaterad
zh_hant: 刷新時間

# about_device_date_refreshed
source: Data Refreshed
da: Data opdateret
de: Daten aktualisiert
sv: Data uppdaterad
zh_hant: 資料已刷新

# about_device_refreshed_failed
source: Refresh Failed
da: Genstart mislykkedes.
de: Aktualisierung fehlgeschlagen
zh_hant: 刷新失敗

# about_device_info_newest
source: This is the latest data.
da: Dette er seneste data
sv: Senaste data
zh_hant: 已是最新資料。

# about_device_refresh
source: Refresh
da: Opdater
de: Aktualisierung
sv: Uppdatera
zh_hant: 重新刷新

# about_device_data_refresh
source: Refresh Data
da: Opdater data
de: Daten aktualisieren
sv: Uppdatera data
zh_hant: 資料刷新

# about_device_lastest_data_please_refresh_after_5_min_content
source: The displayed time is the most recent data retrieved from the device. To view new data, please refresh again in 5 minutes.
da: Den viste tid er den seneste data modtaget fra enheden. For at se ny data, venligst opdater igen om 5 minutter.
de: Bei der angezeigten Zeit handelt es sich um die zuletzt vom Gerät abgerufenen Daten. Um neue Daten anzuzeigen, aktualisieren Sie sie bitte in 5 Minuten erneut.
sv: Den visade tiden är den senaste data som hämtats från enheten. Om du vill visa nya data uppdaterar du igen om 5 minuter.
zh_hant: 顯示的時間是最近從裝置取得資料的時間。 若要查看新資料，請5分鐘後再次刷新。

# auto_test
source: Automated Testing
da: Automatiseret test
de: Automatisierte Tests
sv: Automatiserat test
zh_hant: 自我測試

# common_pass
source: Pass
da: Godkendt
de: Genehmicht
sv: Godkännt
zh_hant: 通過

# common_fail
source: Failed
da: Dumpet
de: Fehlgeschlagen
sv: Misslyckat
zh_hant: 失敗

# auto_test_rs485_connection
source: RS485 Connection
da: RS485 tilslutning
de: RS485-Verbindung
sv: RS485 anslutning
zh_hant: RS485連線

# auto_test_valve_position
source: Valve Position
da: Ventil position
de: Ventilposition
sv: Ventilens possition
zh_hant: 閥門角度

# auto_test_device_faulty
source: Device faulty, please contact manufacturer.
da: Fejl på enhed, venligst kontakt fabrikanten
de: Gerät defekt, bitte wenden Sie sich an den Hersteller.
sv: Enhetet felaktig, kontakta tillverkaren
zh_hant: 設備故障，請聯絡製造商。

# auto_test_ivm_temp
source: IVM Temp.
da: IVM temperatur
de: IVM Temperatur
sv: IVM temperatur
zh_hant: IVM內部溫度

# auto_test_start_test
source: Start test
de: Test starten
sv: Starta test
zh_hant: 開始測試

# ble_connection_lost
source: Connection Interrupted
da: Forbindelsen afbrudt
de: Verbindung unterbrochen
sv: Anslutning avbruten
zh_hant: 連線中斷

# ble_disconnected_content
source: Bluetooth disconnected. Please retry the connection to use the system's automated testing function.
da: Bluetoothforbindelse afbrudt. Forsøg at oprette forbindelse igen for at bruge systemets automatiske testfunktion.
de: Bluetooth-Verbindung getrennt. Bitte versuchen Sie erneut, die Verbindung herzustellen, um die automatische Testfunktion des Systems zu nutzen.
sv: Bluetooth frånkopplad. Försök att ansluta igen för att använda systemets automatiska testfunktion.
zh_hant: 藍牙已斷開。請重試連線以使用自我測試功能。

# ble_reconnect_now
source: Reconnect now
da: Opretter forbindelse igen
de: Jetzt wieder verbinden
sv: Återanslut nu
zh_hant: 立即重新連線

# common_back_menu
source: Back to menu
da: Tilbage til menu
de: Zurück zum Menü
sv: Tillbaka till meny
zh_hant: 返回功能選單

# ble_unable_reconnect
source: Unable Reconnect
da: Kan ikke tilsluttes
de: Wiederverbindung nicht möglich
sv: Det går ej att ansluta
zh_hant: 無法重新連線

# ble_plesae_return_start_screen_repairing_content
source: Please return to the start page and redo the Bluetooth pairing process.
da: Gå tilbage til startsiden og start bluetooth-parringsprocessen igen.
de: Bitte kehren Sie zur Startseite zurück und wiederholen Sie den Bluetooth-Pairing-Vorgang.
sv: Gå tillbaka till startsidan och gör om Bluetooth-parningsprocessen.
zh_hant: 請返回到開始頁面並重新執行藍牙配對程序。

# common_back_start
source: Back to start
da: Tilbage til start
de: Zurück zum Start
sv: Tillbaka till start
zh_hant: 返回開始頁面

# auto_test_in_progress
source: Automated testing in progressâ€¦
da: Automatisk test i gang.
de: Automatisierte Tests laufen…
sv: Automatiskt test pågår
zh_hant: 自我測試執行中...

# auto_test_completed
source: Test Completed
da: Test afsluttet.
de: Test abgeschlossen
sv: Test avslutat
zh_hant: 測試完成

# auto_test_status_newest
source: Up-to-date status.
da: Updateret status
de: Aktueller Stand.
sv: Uppdaterad status
zh_hant: 已是最新狀態。

# auto_test_fail
source: Automated testing Failed
da: Automatisk test mislykkedes.
de: Der automatisierte Test ist fehlgeschlagen
sv: Automatiskt test misslyckat
zh_hant: 測試失敗

# auto_test_please_retry
source: Please retry.
da: Prøv igen
de: Bitte erneut versuchen
sv: Försök igen
zh_hant: 請重試。

# maintenance_records
source: Maintenance Record
da: Vedligeholdelses log
de: Wartungsaufzeichnungen
sv: Underhålls logg
zh_hant: 維修記錄

# maintenance_records_current_valve
source: Current valve
da: Nuværende ventil
de: Aktuelles Ventil
sv: Nuvarande ventil
zh_hant: 當前球閥

# maintenance_records_past_valve
source: Historical valve
da: Tidligere ventil
de: Historisches Ventil
sv: Tidigare ventil
zh_hant: 歷史球閥

source: Record Chart
da: Gemt data
de: Rekorddiagramm
sv: Lagra data
zh_hant: 記錄圖表

# record_chart_emission
source: Emission
sv: Utsläpp
zh_hant: 壓力

# record_chart_last_300_records
source: This chart shows the last 300 records.
da: Dette diagram viser de sidste 300 cycler
de: Dieses Diagramm zeigt die letzten 300 Datensätze.
sv: Det här diagrammet visar de senaste 300 cyklerna.
zh_hant: 此圖表顯示最近300筆記錄

# common_date
source: Date
da: Dato
sv: Datum
zh_hant: 日期

# record_chart_t_e
source: T & E
zh_hant: 扭/壓力

source: Traceability
da: Sporbarhed
de: Rückverfolgbarkeit
sv: Spårbarhet
zh_hant: 生產履歷

# traceability_current_ball_valve_id
source: Current Ball Valve's ID
da: Nuværende ventil ID
de: Aktuelle Ventil-ID
sv: Nuvarande ventil identitet
zh_hant: 當前球閥ID

# traceability_required_serial_no
source: Serial No. Required
zh_hant: 請輸入產品序號

# traceability_serial_no
source: Serial No.
da: Serienummer
de: Seriennummer.
sv: Serie nummer
zh_hant: 產品序號

# traceability_please_enter_serial_no_conent
source: Please enter the product serial No. you purchased to search about the valve's traceability.
da: Indsæt serienummeret du købte for at søge efter ventilens sporbarhed.
de: Bitte geben Sie die Seriennummer des Produkts ein, das Sie gekauft haben, um nach der Rückverfolgbarkeit des Ventils zu suchen.
sv: Ange produktens serienummer. du köpte för att söka efter ventilens spårbarhet.
zh_hant: 請輸入您購買的產品序號以查詢生產履歷

# traceability_serial_no_incorrect
source: Serial No. Incorrect
da: Forkert serienummer
de: Seriennummer. Falsch
sv: Serie nummer felaktigt
zh_hant: 產品序號錯誤

# traceability_serial_number_could_not_identified_conent
source: The serial No. could not be identified. Please double check the valve's serial No.
da: Serienummeret kunne ikke genkendes. Doubletjek venligst ventilens serienummer.
de: Die Seriennummer konnte nicht identifiziert werden. Bitte überprüfen Sie noch einmal die Seriennummer des Ventils.
sv: Serienummret kunde ej identifieras vänligen kontrollera det
zh_hant: 此產品序號無法識別。請再次檢查裝置產品序號。

# traceability_serial_no_should_12_chars_content
source: Valve's serial No. should contain 12 characters.
da: Ventilens serienummer skal bestå af 12 tegn
de: Die Seriennummer von Valve sollte 12 Zeichen enthalten.
sv: Ventilens serienummer ska innehålla 12 tecken.
zh_hant: 產品序號應包含12字元。

# device_settings_
source: Device Setting
da: Enhedens indstillinger
de: Geräteeinstellungen
sv: Enhetens innställningar
zh_hant: 裝置設定

# device_settings_item
source: Setting item
da: Indstilling af enhed
de: Einstellungselement
sv: Ställ in enhet
zh_hant: 設定項目

# device_settings_unit
source: Unit
da: Enhed
de: Einheit
sv: Enhet
zh_hant: 單位

# device_settings_limit
source: Limit
da: Begrænsning
de: Grenze
sv: Gräns
zh_hant: 上下限

# device_settings_close
source: Close
da: Luk
de: Schließen
sv: Stäng
zh_hant: 關

# device_settings_open
source: Open
da: Åben
de: Offen
sv: Öppen
zh_hant: 開

# device_settings_alert_value
source: Alert Value
da: Alarm værdi
de: Alarmwert
sv: Larmvärde
zh_hant: 警示值

# common_save
source: Save
da: Gem
de: Speichern
sv: Spara
zh_hant: 儲存

# device_settings_valve_torque
source: Valve Torque
da: Ventil moment
de: Ventildrehmoment
sv: Ventil moment
zh_hant: 閥門扭力

# device_settings_valve_torque_abnormal_content
source: Once the value of torque is below or above the set value, the LED indicator will show abnormal light.
zh_hant: 一旦扭力值超出上下限，LED 燈將顯示異常燈號。

# device_settings_emission_detection
source: Emission Detection
da: Emissionsgrad
de: Emissionserkennung
sv: Utsläpp detekterat
zh_hant: 閥門壓力

# device_settings_emission_detection_abnormal
source: Once the value of emission is below or above the set value, the LED indicator will show abnormal light.
zh_hant: 一旦壓力值超出上下限，LED 燈將顯示異常燈號。

# device_settings_min
source: Min. value
da: Min. Værdi
de: Mindest. Wert
sv: Min värde
zh_hant: 最小值

# device_settings_max
source: Max. value
da: Max. Værdi
de: Max. Wert
sv: Max värde
zh_hant: 最大值

# device_settings_factory_default
source: Factory default
da: Fabriksindstillinger
de: Werkseinstellung
sv: Fabriksinnställningar
zh_hant: 出廠預設值

# device_settings_valve_position
source: Valve Position
da: Ventil position
de: Ventilposition
sv: Ventil possition
zh_hant: 閥門開關

# device_settings_angle_setting
source: Angle Setting
da: Indstil vinklen.
de: Winkeleinstellung
sv: Inställd vinkel
zh_hant: 開關角度設定

# device_settings_angle_setting_content
source: The device will record each valve opening and closing operation based on the configured opening and closing angle thresholds.
da: Enheden vil registrerer hver ventils åben- og lukkeoperation baseret på den konfigurerede åbne- pg lukkevinkel.
de: Das Gerät zeichnet jeden Öffnungs- und Schließvorgang des Ventils basierend auf den konfigurierten Öffnungs- und Schließwinkelschwellen auf.
sv: Enheten kommer att registrera varje ventilöppnings- och stängningsoperation baserat på de konfigurerade tröskelvärdena för öppnings- och stängningsvinkel.
zh_hant: 裝置會根據所設定的開關角度值記錄每次閥門的開關操作。

# device_settings_closing_angle
source: Closing Angle
da: Lukkevinkel
de: Schließwinkel
sv: Stängningsvinkel
zh_hant: 關閉角度

# device_settings_opening_angle
source: Opening Angle
da: Åbningsvinkel
de: Öffnungswinkel
sv: Öppningsvinkel
zh_hant: 開啟角度

# device_settings_sp_setting
source: Switch point setting
zh_hant: 角度設定

# device_settings_sp_1
source: SP angle-1
zh_hant: 第 1 個角度

# device_settings_sp_2
source: SP angle-2
zh_hant: 第 2 個角度

# device_settings_sp_out_of_range
source: SP Out of Range
zh_hant: 角度超過範圍

# device_settings_sp_setting_chaek
source: The angle of switch point should be between opening & closing angle. Please check the switch point angle again.
zh_hant: 設定的角度必須在開啟角度與關閉角度之間。 請再次確認設定的角度。

# device_settings_device_lacation
source: Device Location
da: Enhedsposition
de: Gerätestandort
sv: Possition
zh_hant: 裝置位置

# device_settings_device_lacation_content
source: Add a location description to enhance device identification. (Limit: 50 characters)
da: Tilføj lokationsbeskrivelse for at forbedre enhedsidentifikation (Begrænsning: 50 tegn)
de: Fügen Sie eine Standortbeschreibung hinzu, um die Geräteidentifizierung zu verbessern. (Limit: 50 Zeichen)
sv: Lägg till en platsbeskrivning för att förbättra enhetsidentifieringen. (Gräns: 50 tecken)
zh_hant: 新增位置描述以提高設備識別。(限制50字元)

# device_settings_add_description
source: Add location description here
da: Tilføj lokationsbeskrivelse her
de: Fügen Sie hier eine Standortbeschreibung hinzu
sv: Lägg till platsbeskrivning här
zh_hant: 在此新增位置描述

# device_settings_led_indicator
source: LED indicator
da: LED indikator
de: LED-Anzeige
sv: LED indikering
zh_hant: 燈光指示

# device_settings_led_indicator_conent
source: Set different colors for each state (except for fault states) to enhance operational recognition.
da: Vælg forskellige farver for hvert stadie (foruden fejlstadie) for at forbedre den operationelle genkendelse.
de: Legen Sie für jeden Zustand (außer Fehlerzustände) unterschiedliche Farben fest, um die Betriebserkennung zu verbessern.
sv: Ange olika färger för varje tillstånd (förutom feltillstånd) för att förbättra den operativa igenkänningen.
zh_hant: 為每個狀態（故障狀態除外）設定不同的顏色，以提高動作辨識性。

# device_settings_led_abnormal
source: Abnormal / Fault
da: Afvigelse / Fejl
de: Abnormal / Fehler
sv: Avvikelse/fel
zh_hant: 異常/故障

# device_settings_led_maintenande_notify
source: Maintenance notify
da: Vedligeholdelsesmeddelelse
de: Wartungsbenachrichtigung
sv: Underhålls anmodan
zh_hant: 保養通知

# device_settings_led_valve_open
source: Valve Open
da: Ventil åben
de: Ventil offen
sv: Ventil öppen
zh_hant: 閥門開啟

# device_settings_led_valve_close
source: Value Close
da: Ventil lukket
de: Ventil schließen
sv: Ventil stängd
zh_hant: 閥門關閉

# device_settings_led_rs485_disconnected
source: RS485 Disconnected
da: RS485 afbrudt
de: RS485 getrennt
sv: RS458 Bortkopplad
zh_hant: RS485未連線

# device_settings_led_rs485_connected
source: RS485 Connected
da: RS485 tilsluttet
de: RS485 verbunden
sv: RS458 Ansluten
zh_hant: RS485已連線

# device_settings_led_ble_disconnected
source: BLE Disconnected
da: BLE afbrudt
de: BLE getrennt
sv: BLE Bortkopplad
zh_hant: 藍牙未連線

# device_settings_led_ble_connected
source: BLE Connected
da: BLE tilsluttet
de: BLE verbunden
sv: BLE Ansluten
zh_hant: 藍牙已連線

# device_settings_led_short_flash
source: Short Flash
da: Kort blink
de: Kurzer Blitz
sv: Kort blink
zh_hant: 短閃

# device_settings_led_long_flash
source: Long Flash
da: Langt blink
de: Langer Blitz
sv: Lång blink
zh_hant: 長閃

# device_settings_led_constant
source: Constant
da: Konstant
de: Konstante
sv: Konstant
zh_hant: 恆亮

# device_settings_led_breathing
source: Breathing
da: Pulserende
de: Atmung
sv: Pulserande
zh_hant: 呼吸燈

source: Replace Ball Valve
da: Erstat ventil
de: Kugelhahn ersetzen
zh_hant: 更換球閥

# replace_ball_valve_enter_new_id
source: After replacing the ball valve, you need to set the new ball valve's serial No. to synchronize the correct data.
da: Efter at have erstattet ventilen, skal du indtaste den nye ventils serienummer, for at synkronisere data.
de: Nach dem Austausch des Kugelhahns müssen Sie die Seriennummer des neuen Kugelhahns einstellen, um die korrekten Daten zu synchronisieren.
zh_hant: 更換球閥後需輸入新的球閥ID以同步正確資料

# replace_ball_valve_confirm
source: Replace Confirm
da: Erstatning bekræftet
de: Ersatz Bestätigen
zh_hant: 更換確認

# replace_ball_valve_seccess
source: Save Successfully
da: Gemt
de: Erfolgreich gespeichert
zh_hant: 儲存成功

# replace_ball_valve_setting_saved
source: Setting is saved.
da: Indstilling er gemt.
de: Einstellung wird gespeichert.
zh_hant: 設定已儲存

source: Maintenance notify
da: Vedligeholdelsesmeddelelse
de: Wartungsbenachrichtigung
sv: Underhålls anmodan
zh_hant: 保養通知

# maintenance_notify_configured_threshold
source: The maintenance indicator light will turn on to notify when the Ball Valve usage reaches the configured threshold value.
zh_hant: 當球閥使用次數達到設定的週期次數後，保養燈將會亮起通知。

# maintenance_notify_cycle_counter
source: Cycle counter time(s)
zh_hant: 週期計算次數

# maintenance_notify_cycle_counter_times
source: Current cycle counter time(s)
zh_hant: 當前週期計算次數

# maintenance_notify_reset
source: Reset
zh_hant: 重置

# maintenance_notify_initial_setting
source: Initial setting
zh_hant: 安裝後設定

source: Address ID
zh_hant: 位址ID

source: Baud rate
zh_hant: 調變速率

source: Terminal resistor switch
zh_hant: 終端電阻開關

source: STEM
zh_hant: 中軸

source: Calibrate angle
zh_hant: 校正角度

source: Setting Hint
zh_hant: 設定提示

# rs485_enter_id_content
source: RS485 Identification ID. Please enter a value between 1-255. RS485 Address IDs in the same series cannot be duplicated.
zh_hant: RS485 的辨識 ID，請輸入 1~255 的數值。同一串列中的 RS485 Address ID 不可重複。

# rs485_cable_length_content
source: The communication speed of RS485 cable. Generally higher baud rates mean faster transmission, but lower rates can better maintain stability with longer cable runs. Suggested baud rates based on cable length:
zh_hant: RS485 纜線的調變速率，通常速率越高傳輸速度越快，但當纜線長度較長時，設定低速較能維持傳輸穩定度。 調變速率設定與纜線長度建議值：

# rs485_suggested_baud_rates_based_on_cable_length
source: Must not exceed 1100 m
zh_hant: 請勿超過 1100 m

# rs485_recommended_values_content
source: The above recommended values are based on using: 24 AWG, twisted pair, unshielded, 52.4 pF/meter cable.
zh_hant: 上述建議值使用的線材是：24AWG，雙絞線，無隔離，52.4pF/meter

# rs485_termination_resistor_sontent
source: When the IVM is the last device in the series, please turn on the termination resistor switch for this item.
zh_hant: 當 IVM 為同一串列中的最末台裝置時，請將終端電阻開關此項目切換至「開」狀態。

# fw_update
source: Firmware Update
da: Program opdatering
sv: Programmvaru uppdatering
zh_hant: 韌體更新

# fw_update_version
source: Firmware version
da: Program version
sv: Version av inbyggd programvara
zh_hant: 韌體版本

# fw_update_update
source: Update
da: Opdater
de: Aktualisieren
zh_hant: 更新

# fw_update_last_updated_date
source: Last updated date
da: Dato for sidste opdatering
de: Datum der letzten Aktualisierung
sv: Datum för senaste uppdatering
zh_hant: 最後更新日期
