Repository: JumBoJay06/tawd_ivm
Catalog: lib/l10n/intl_*.arb
Languages: da, de, sv, zh_hant

# fw_update_select_file_content
source: Format Error
da: Fejl format
de: Format Fehler
sv: Felaktigt format
zh_hant: 檔案格式錯誤

# fw_update_select_file
source: Incorrect file format. Please select a .bin file.
da: Forkert filformat. Vælg venligst en .bin fil.
de: Falsches Dateiformat. Bitte wählen Sie eine .bin-Datei aus.
sv: Felaktigt filformat. Välj en .bin fil.
zh_hant: 檔案格式錯誤。請選取.bin的檔案。

# fw_update_file_error
source: Download Error
da: Download fejl
de: Download Fehler
zh_hant: 下載錯誤

# fw_update_file_error_content
source: Unable to download file from server. Please check your internet connection.
da: Ikke i stand til at downloade fil fra serveren. Kontroller din internetforbindelse.
de: Datei kann nicht vom Server heruntergeladen werden. Bitte überprüfe deine Internetverbindung.
zh_hant: 無法從伺服器下載更新檔，請確認您的網路連線。

# fw_update_download_error
source: Firmware Update
da: Program opdatering
sv: Programmvaru uppdatering
zh_hant: 韌體更新

# fw_update_dialog_content
source: Update firmware to ...?
da: Opdater program til … ?
de: Firmware aktualisieren auf ...?
sv: Uppdatera programmvara till
zh_hant: 確定更新韌體至...版本？

# fw_update_dialog_yes
source: Yes, update now
da: Ja, opdater nu
de: Ja, jetzt aktualisieren
sv: Ja uppdatera nu
zh_hant: 是，立即更新

# fw_update_dialog_no
source: No, update later
da: Nej, opdater senere
de: Nein, später aktualisieren
sv: Nej uppdatera senare
zh_hant: 不，稍後再更新

# fw_update_updating
source: Updating firmware...
da: Opdaterer program…
de: Firmware wird aktualisiert…
sv: Uppdaterar programvara
zh_hant: 更新韌體中...

# fw_update_completed
source: Update Completed
da: Opdatering færdig
de: Update abgeschlossen
sv: Uppdatering klar
zh_hant: 更新完成

# fw_update_version_is_newest
source: Already at the latest firmware version.
da: Programmet er allerede den nyeste version
de: Bereits auf der neuesten Firmware-Version.
sv: Senaste programvara instalerad
zh_hant: 已是最新韌體版本。

# fw_update_fail
source: Update Failed
da: Opdatering mislykkedes
de: Update fehlgeschlagen
sv: Uppdatering misslyckades
zh_hant: 更新失敗
